/**
 * @Author: peimengmeng
 * @Date: 2020/12/17 9:40
 * @Desc: 命令模式
 *      将一个请求封装为一个对象，从而使你可用不同的请求对客户进行参数化，对请求排队或记录请求日志。以及支持可撤销的操作。
 *      说白了，就是将一系列的请求命令封装起来，不直接调用真正执行者的方法，这样比较好扩展。
 *
 *      Command（抽象命令类）：抽象出命令对象，可以根据不同的命令类型。写出不同的实现类
 *      ConcreteCommand（具体命令类）：实现了抽象命令对象的具体实现
 *      Invoker（调用者/请求者）：请求的发送者，它通过命令对象来执行请求。一个调用者并不需要在设计时确定其接收者，因此它只与抽象命令来之间存在关联。
 *                  在程序运行时，将调用命令对象的execute() ，间接调用接收者的相关操作。
 *      Receiver（接收者）：接收者执行与请求相关的操作，真正执行命令的对象。具体实现对请求的业务处理。未抽象前，实际执行操作内容的对象。
 *      Client（客户端）：在客户类中需要创建调用者对象，具体命令类对象，在创建具体命令对象时指定对应的接收者。发送者和接收者之间没有之间关系。都通过命令对象来调用。
 */
package com.peysen.gof23.behaviour.command;
